🚀&nbsp; env0 had composed a PR Plan for environment [My First Project / vcs-environment-54333 ](https://app.env0.com/p/623859c1-0256-4315-8773-f165790ef42e/environments/34a4db2d-55ba-46f8-bd41-d5d035eb7f25):
```
Plan: 4 to add, 4 to change, 0 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:


  # aws_eip.hashicat will be created
+   resource "aws_eip" "hashicat" {
+       allocation_id        = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = (known after apply)
+       id                   = (known after apply)
+       instance             = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags_all             = (known after apply)
+       vpc                  = true
    }

  # aws_eip_association.hashicat will be created
+   resource "aws_eip_association" "hashicat" {
+       allocation_id        = (known after apply)
+       id                   = (known after apply)
+       instance_id          = (known after apply)
+       network_interface_id = (known after apply)
+       private_ip_address   = (known after apply)
+       public_ip            = (known after apply)
    }


  # aws_instance.hashicat will be created
+   resource "aws_instance" "hashicat" {
+       ami                                  = "ami-0d23ec1228995e83b"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = true
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t2.micro"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = "helloworld2-ssh-key.pem"
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       subnet_id                            = "subnet-09b65cea796ee1f42"
+       tags                                 = {
+           "Name"            = "helloworld2-hashicat-instance"
+           "billing"         = "dev"
+           "env"             = "dev"
+           "owner"           = "chance.kim@sendbird.com"
+           "purpose"         = "testing"
+           "sbregion"        = "dev"
+           "sendbird_region" = "dev"
        }
+       tags_all                             = {
+           "Name"            = "helloworld2-hashicat-instance"
+           "billing"         = "dev"
+           "env"             = "dev"
+           "owner"           = "chance.kim@sendbird.com"
+           "purpose"         = "testing"
+           "sbregion"        = "dev"
+           "sendbird_region" = "dev"
        }
+       tenancy                              = (known after apply)
+       vpc_security_group_ids               = [
+           "sg-0da2d2b64e47fbd2b",
        ]

+       capacity_reservation_specification {
+           capacity_reservation_preference = (known after apply)

+           capacity_reservation_target {
+               capacity_reservation_id = (known after apply)
            }
        }

+       ebs_block_device {
+           delete_on_termination = (known after apply)
+           device_name           = (known after apply)
+           encrypted             = (known after apply)
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           snapshot_id           = (known after apply)
+           tags                  = (known after apply)
+           throughput            = (known after apply)
+           volume_id             = (known after apply)
+           volume_size           = (known after apply)
+           volume_type           = (known after apply)
        }

+       enclave_options {
+           enabled = (known after apply)
        }

+       ephemeral_block_device {
+           device_name  = (known after apply)
+           no_device    = (known after apply)
+           virtual_name = (known after apply)
        }

+       metadata_options {
+           http_endpoint               = (known after apply)
+           http_put_response_hop_limit = (known after apply)
+           http_tokens                 = (known after apply)
        }

+       network_interface {
+           delete_on_termination = (known after apply)
+           device_index          = (known after apply)
+           network_interface_id  = (known after apply)
        }

+       root_block_device {
+           delete_on_termination = (known after apply)
+           device_name           = (known after apply)
+           encrypted             = (known after apply)
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           tags                  = (known after apply)
+           throughput            = (known after apply)
+           volume_id             = (known after apply)
+           volume_size           = (known after apply)
+           volume_type           = (known after apply)
        }
    }


  # aws_internet_gateway.hashicat will be updated in-place
!   resource "aws_internet_gateway" "hashicat" {
        id       = "igw-04c2d4b17017fb4cf"
!       tags     = {
+           "billing"         = "dev"
+           "env"             = "dev"
+           "owner"           = "chance.kim@sendbird.com"
+           "purpose"         = "testing"
+           "sbregion"        = "dev"
+           "sendbird_region" = "dev"
            # (1 unchanged element hidden)
        }
!       tags_all = {
+           "billing"         = "dev"
+           "env"             = "dev"
+           "owner"           = "chance.kim@sendbird.com"
+           "purpose"         = "testing"
+           "sbregion"        = "dev"
+           "sendbird_region" = "dev"
            # (1 unchanged element hidden)
        }
        # (3 unchanged attributes hidden)
    }


  # aws_security_group.hashicat will be updated in-place
!   resource "aws_security_group" "hashicat" {
        id                     = "sg-0da2d2b64e47fbd2b"
        name                   = "helloworld2-security-group"
!       tags                   = {
+           "billing"         = "dev"
+           "env"             = "dev"
+           "owner"           = "chance.kim@sendbird.com"
+           "purpose"         = "testing"
+           "sbregion"        = "dev"
+           "sendbird_region" = "dev"
            # (1 unchanged element hidden)
        }
!       tags_all               = {
+           "billing"         = "dev"
+           "env"             = "dev"
+           "owner"           = "chance.kim@sendbird.com"
+           "purpose"         = "testing"
+           "sbregion"        = "dev"
+           "sendbird_region" = "dev"
            # (1 unchanged element hidden)
        }
        # (7 unchanged attributes hidden)
    }


  # aws_subnet.hashicat will be updated in-place
!   resource "aws_subnet" "hashicat" {
        id                              = "subnet-09b65cea796ee1f42"
!       tags                            = {
+           "billing"         = "dev"
+           "env"             = "dev"
+           "owner"           = "chance.kim@sendbird.com"
+           "purpose"         = "testing"
+           "sbregion"        = "dev"
+           "sendbird_region" = "dev"
            # (1 unchanged element hidden)
        }
!       tags_all                        = {
+           "billing"         = "dev"
+           "env"             = "dev"
+           "owner"           = "chance.kim@sendbird.com"
+           "purpose"         = "testing"
+           "sbregion"        = "dev"
+           "sendbird_region" = "dev"
            # (1 unchanged element hidden)
        }
        # (9 unchanged attributes hidden)
    }


  # aws_vpc.hashicat will be updated in-place
!   resource "aws_vpc" "hashicat" {
        id                               = "vpc-0e812519985a1c6e9"
!       tags                             = {
+           "billing"         = "dev"
+           "env"             = "dev"
-           "environment"     = "Production" -> null
+           "owner"           = "chance.kim@sendbird.com"
+           "purpose"         = "testing"
+           "sbregion"        = "dev"
+           "sendbird_region" = "dev"
            # (1 unchanged element hidden)
        }
!       tags_all                         = {
+           "billing"         = "dev"
+           "env"             = "dev"
-           "environment"     = "Production" -> null
+           "owner"           = "chance.kim@sendbird.com"
+           "purpose"         = "testing"
+           "sbregion"        = "dev"
+           "sendbird_region" = "dev"
            # (1 unchanged element hidden)
        }
        # (14 unchanged attributes hidden)
    }


  # null_resource.configure-cat-app will be created
+   resource "null_resource" "configure-cat-app" {
+       id       = (known after apply)
+       triggers = (known after apply)
    }

Plan: 4 to add, 4 to change, 0 to destroy.

Changes to Outputs:
+   catapp_ip  = (known after apply)
+   catapp_url = (known after apply)
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "purpose" but a value was
│ found in file "env0.auto.tfvars.json". If you meant to use this value, add
│ a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "env" but a value was
│ found in file "env0.auto.tfvars.json". If you meant to use this value, add
│ a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│ 
│ In addition to the other similar warnings shown, 2 other variable(s)
│ defined without being declared.
╵
```
</details>


```
Monthly cost change for kychool/hashicat-aws/env0_tf_plan.json
Amount:  +$9.27 ($0.00 → $9.27)

```
<details>
<summary>Cost Estimation Details</summary>

```diff
Project: kychool/hashicat-aws/env0_tf_plan.json

+ aws_instance.hashicat
  +$9.27

+     Instance usage (Linux/UNIX, on-demand, t2.micro)
      +$8.47

+     root_block_device
    
+         Storage (general purpose SSD, gp2)
          +$0.80

Monthly cost change for kychool/hashicat-aws/env0_tf_plan.json
Amount:  +$9.27 ($0.00 → $9.27)

──────────────────────────────────
Key: ~ changed, + added, - removed

10 cloud resources were detected:
∙ 1 was estimated, it includes usage-based costs, see https://infracost.io/usage-file
∙ 9 were free, rerun with --show-skipped to see details
```
</details>


[Full PR Plan logs on env0](https://app.env0.com/p/623859c1-0256-4315-8773-f165790ef42e/environments/34a4db2d-55ba-46f8-bd41-d5d035eb7f25/deployments/2fa0c665-8a1e-44db-ab95-2ce2d6ff7931)